nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe247/demo_apps/mc_pmsm/pmsm_snsless/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONsPins(void);

#define PORT_DFER_DFE_8_MASK 0x0100u /*!<@brief Digital Filter Enable Mask for item 8. */
#define PORT_DFER_DFE_9_MASK 0x0200u /*!<@brief Digital Filter Enable Mask for item 9. */

/*! @name PORTD8 (number 55), I2C1_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITI2CPINS_I2C1_SDA_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2CPINS_I2C1_SDA_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITI2CPINS_I2C1_SDA_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTD9 (number 54), I2C1_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITI2CPINS_I2C1_SCL_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2CPINS_I2C1_SCL_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITI2CPINS_I2C1_SCL_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2CPins(void);

/*! @name PORTD15 (number 29), PWM_AT_CH0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITFTM_PWM_AT_CH0_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFTM_PWM_AT_CH0_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITFTM_PWM_AT_CH0_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORTD16 (number 28), PWM_AB_CH1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITFTM_PWM_AB_CH1_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFTM_PWM_AB_CH1_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITFTM_PWM_AB_CH1_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORTB16 (number 94), PWM_BT_CH4
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITFTM_PWM_BT_CH4_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFTM_PWM_BT_CH4_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITFTM_PWM_BT_CH4_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORTB17 (number 93), PWM_BB_CH5
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITFTM_PWM_BB_CH5_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFTM_PWM_BB_CH5_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITFTM_PWM_BB_CH5_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORTA17 (number 92), PWM_CT_CH6
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITFTM_PWM_CT_CH6_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFTM_PWM_CT_CH6_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITFTM_PWM_CT_CH6_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORTE7 (number 87), PWM_CB_CH7
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITFTM_PWM_CB_CH7_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFTM_PWM_CB_CH7_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITFTM_PWM_CB_CH7_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFTM(void);

/*! @name PORTA15 (number 120), CUR_A
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC_CUR_A_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC_CUR_A_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITADC_CUR_A_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTA6 (number 85), CUR_B
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC_CUR_B_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC_CUR_B_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITADC_CUR_B_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTD4 (number 100), CUR_C
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC_CUR_C_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC_CUR_C_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITADC_CUR_C_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTA0 (number 115), VOLT_DCB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC_VOLT_DCB_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC_VOLT_DCB_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITADC_VOLT_DCB_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitADC(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCMP(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitTP(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
